/* -------------------------------------------------------------------------- */
/* Enums */
/* -------------------------------------------------------------------------- */

/* TINTodoStatus */

"OLNMOe" = "状态"; /* Display Name */

"mQr54o" = "未知";   /* Value: unknown */
"8K78Gu" = "打开";      /* Value: open */
"HSjTOt" = "已完成"; /* Value: completed */
"1Ncljt" = "已取消";  /* Value: canceled */

/* -------------------------------------------------------------------------- */
/* Types */
/* -------------------------------------------------------------------------- */

/* TINTodo */

"OMXxQN" = "Things 待办事项"; /* Display Name */

"q1gqw8" = "UUID";      /* Property: uuid */
"LiLlEf" = "标题";     /* Property: title */
"Kw5NWX" = "列表";      /* Property: list */
"R3fuSz" = "时间";      /* Property: when */
"8TjwzE" = "夜晚";   /* Property: evening */
"gRh7no" = "否";        /* Property: evening (false value) */
"WHB5qC" = "是";       /* Property: evening (true value) */
"bww4JS" = "提醒事项";  /* Property: reminder */
"19lPBk" = "截止日期";  /* Property: deadline */
"pp3qBd" = "备注";     /* Property: notes */
"UDIc1x" = "检查列表"; /* Property: checklist */
"KQzIKq" = "标签";      /* Property: tags */

/* TINList */

"x7Empa" = "Things 列表"; /* Display Name */

/* -------------------------------------------------------------------------- */
/* Intents */
/* -------------------------------------------------------------------------- */

/* TINAddTodo */

"jUtU4g" = "添加待办事项"; /* Title */
"1Xn7Aa" = "向 Things 中添加新的待办事项。"; /* Description */

"YmSQDf" = "待办事项"; /* Parameter: title */
"LHHz9E" = "标题是什么"; /* Parameter: title, dialog (Primary) */

"ZlzpNK" = "列表"; /* Parameter: list */
"X4r1DR" = "想要添加哪个列表？"; /* Parameter: list, dialog (DisambiguationSelection) */

"unnTAD" = "时间"; /* Parameter: when */
"VkNe0C" = "您想要什么时候开始？"; /* Parameter: when, dialog (Primary) */

"gaX3hF" = "夜晚"; /* Parameter: evening */
"b10WOZ" = "是夜晚吗？"; /* Parameter: evening, dialog (Primary) */
"0fPzah" = "否"; /* Parameter: evening (false value) */
"KWUIrj" = "是"; /* Parameter: evening (true value) */

"AeXgbS" = "提醒时间"; /* Parameter: reminderTime */
"3Nk1Yl" = "您想要在什么时间提醒？"; /* Intent TINAddTodo -> Parameter: reminderTime, dialog (Primary) */

"BzuFhi" = "截止日期"; /* Parameter: deadline */
"xi8sPe" = "截止日期是什么时候？"; /* Parameter: deadline, dialog (Primary) */

"NYFM84" = "标签"; /* Parameter: tags */
"l0xizU" = "应添加哪个标签？"; /* Parameter: tags, dialog (Primary) */

"tfx4bF" = "状态"; /* Parameter: status */
"sS5Ms4" = "状态是什么？"; /* Parameter: status, dialog (DisambiguationSelection) */

"DZdOjf" = "在 Things 中编辑"; /* Parameter: editInThings */
"W5N6Yo" = "是否要打开 Things，编辑此待办事项？"; /* Parameter: editInThings, dialog (Primary) */
"bRVelp" = "否"; /* Parameter: editInThings (false value) */
"ZSGv41" = "是"; /* Parameter: editInThings (true value) */

"o8AABR" = "备注"; /* Parameter: notes */
"pjyLst" = "您想要添加什么备注？"; /* Parameter: notes, dialog (Primary) */

"uHRvWn" = "检查列表"; /* Parameter: checklist */
"VIitBC" = "您想要添加什么检查列表项目？"; /* Parameter: checklist, dialog (Primary) */

"6nhwMl" = "${todoTitle} 已添加。"; /* Response Code: success (voice-only dialog) */
"NKVz1k" = "${todoTitle} 已添加。"; /* Response Code: success (printed dialog) */
"sr1IRz" = "在添加待办事项时发生错误。"; /* Response Code: failure (voice-only dialog) */
"LyHwKB" = "在添加待办事项时发生错误。"; /* Response Code: failure (printed dialog) */
"j6LE7B" = "待办事项已添加。"; /* Response Code: successEmptyTitle (voice-only dialog) */
"rNH42i" = "待办事项已添加。"; /* Response Code: successEmptyTitle (printed dialog) */

"Lj80pA" = "待办事项标题"; /* Response Parameter: todoTitle */
"Br1Zm3" = "待办事项"; /* Response Parameter: todo */

"9LylOv" = "添加 ${title}"; /* Shortcuts App: title,list,status,when,deadline,notes,checklist,tags,editInThings (title) */
"wBHz6x" = "添加 ${title}"; /* Shortcuts App: title,notes,checklist,when,deadline,tags,list,status,editInThings,reminderTime,evening (title) */

/* TINShowTodo */

"jANQXX" = "显示待办事项"; /* Title */
"JdIZ8x" = "显示 Things 中的特定待办事项。"; /* Description */

"WAIq5F" = "待办事项"; /* Parameter: todo */

"YIbDyi" = "显示 ${todo}"; /* Shortcuts App: todo (title) */

/* TINShowList */

"ptz6wF" = "显示列表"; /* Title */
"xo5PDm" = "显示 Things 的特定列表。"; /* Description */

"RW2Nyz" = "列表"; /* Parameter: list */
"V1nlDA" = "哪个列表？"; /* Parameter: list, dialog (DisambiguationSelection) */

"3hu2WN" = "按标签筛选"; /* Parameter: filterByTags */
"HQ0TAS" = "哪个标签？"; /* Parameter: filterByTags, dialog (DisambiguationSelection) */

"vKhBKF" = "显示 ${list}"; /* Shortcuts App: list,filterByTags (title) */
"poYHAf" = "显示 ${list}"; /* Shortcuts App: list (title) */

"mlANgr" = "显示 ${list}"; /* Suggestions: list (title) */

/* TINRunThingsURL */

"lW66Em" = "运行 Things URL"; /*  Title */
"keYeZ9" = "在后台运行Things URL。"; /*  Description */

"uPeA3l" = "Things URL"; /*  Parameter: url */
"oTrE0f" = "什么是 URL"; /* Intent TINRunThingsURL -> Parameter: url, dialog (Primary) */

"Xq4kUL" = "URL 已经成功运行。"; /*  Response Code: success (voice-only dialog) */
"DDKH5R" = "URL 已经成功运行。"; /*  Response Code: success (printed dialog) */
"a4aEdR" = "在运行 URL 时发生错误。"; /*  Response Code: failure (voice-only dialog) */
"LNTEqX" = "在运行 URL 时发生错误。"; /*  Response Code: failure (printed dialog) */

"uth0Px" = "运行 Things URL ${url}"; /*  Shortcuts App: url (title) */

/* INAddTasks (customized system intent) */

"3s4Pq7" = "添加任务"; /* Title */
"J4CdGj" = "使用内置功能向 Things 中添加待办事项。仅支持有限的几组参数。"; /* Intent AddTasks -> Description */

"IF3OZi" = "任务列表"; /* Parameter: targetTaskList */
"uNB8yE" = "标题"; /* Parameter: taskTitles */
"2x4fQs" = "Spatial Event Trigger"; /* Parameter: spatialEventTrigger */
"itSKVK" = "Temporal Event Trigger"; /* Parameter: temporalEventTrigger */

"sLae48" = "打开 Things"; /* Suggestions:  (title) */
